LEXICON_RU = {
    'register': 'Привет, друг!❣️\nРады, что ты интересуешься темой ESG и хочешь изменить мир к лучшему!😌\n\nСейчас ты '
                'можешь узнать больше о ESG  и  проверить насколько твои повседневные привычки соответствуют этим '
                'принципам. А также сможешь проверить свой бизнес на экологичность.♻️\n\nЧтобы начать, выбери одну из '
                'кнопок ниже)',
    'start_b2b': 'Бизнес💼',
    'start_b2c': 'Человек🧤',
    'void_name': 'Вы не ввели название, пожалуйста введите еще раз',
    'registration_complete': 'Вы успешно зарегистрированы',
    'quiz_get_result': "Опрос завершен! Нажмите ниже, чтобы получить результаты)",
    'quiz_get_result_button': "Получить результат",
    'menu_message': "Выберите, что хотите сделать",
    'back_button': "Назад",
    'my_score': {
        "message": "Ваш баланс: {}",
        "button1": "Заработать",
        "button2": "Потратить"
    },
    'what_study': {
        "message": "Учебные материалы",
        "button1": "Видеоуроки",
        "button2": "Книги и статьи",
        "button3": "Для меня"
    },
    'eco_org': {
        "message": "Узнайте больше про эко-организации",
        "button1": "Встречи",
        "button2": "Список"
    },
    'have_idea': {
        "message": "Поделитесь своей идеей",
        "button1": "Шаблонный план ESG",
        "button2": "Детальный план"
    },
    'earn_score': {
        "message": "Здесь вы можете заработать баллы",
        "button1": "А ты знаешь",
        "button2": "Задания"
    },
    'buy_score': {
        "message": "Здесь вы можете потратить баллы",
        "button1": "Мерч",
        "button2": "Экскурсии",
        "button3": "Встречи с экспертами",
        "button4": "Путешествие",
        "button5": "Партнеры",
    },
    'template_idea': {
        "message": "Примеры, которые мы собрали для вас",
        "button1": "Видеоуроки",
        "button2": "Тесты",
        "button3": "План"
    },
    'plan_idea': {
        "message": "Создайте свой индивидуальный план",
        "button1": "Конкретный план для начинающих",
        "button2": "Встречи с экспертом",
        "button3": "Материалы для меня"
    },
    'pick_tasks': {
        'message': 'Выберите раздел с заданиями',
        'button1': 'Избранные',
        'button2': 'Выполненные',
        'button3': 'Новые задания',
    },
    'themes_earn': {
        "message": "Список доступных тем"
    },
    'menu_b2c': {
        "message": "Выберите, что хотите сделать"
    },
    'b2b': {
        'return': 'С возвращением!',
        'menu_button1': "Насколько мой бизнес ESG",
        'menu_button2': "ЭКО организации региона",
        'menu_button3': "Топ список компаний ESG",
        'menu_button4': "Пройти опрос заново",
        'register_message': "Отлично, значит вы организация! Пожалуйста введите свое название:",
        'quiz_success': 'Поздравляем! Вы построили экологичный бизнес',
        'quiz_start': 'Пройдите небольшой опрос, чтобы узнать уровень экологичности вашей компании',
        'quiz_result': "Процент экологичности вашего бизнеса {}%",
        'quiz_questions': [
            "Делает ли ваш бизнес что-то, чтобы беречь нашу планету и окружающую среду?",
            "Старается ли ваша компания экономить электроэнергию и не тратить ее много?",
            "Уделяет ли ваша компания внимание условиям работы сотрудников и их комфорту?",
            "Обеспечиваете ли вы безопасные условия труда, чтобы избежать травм сотрудников?",
            "Помогает ли ваш бизнес местным сообществам и поддерживает их?",
            "Стремится ли ваша компания сделать мир лучше через свои действия?",
            "Стремится ли ваш бизнес соблюдать нормы и стандарты в своей деятельности?",
            "Управляет ли ваша компания финансами ответственно и эффективно?",
            "Гарантирует ли ваш бизнес, что его продукты и услуги всегда будут качественными и полезными?",
        ],
        'quiz_advices': [
            'Рассмотрите возможности сокращения использования одноразовой упаковки, пересмотрите свои '
            'производственные процессы с'
            'целью уменьшения отходов и выбросов. Можете изучить концепцию "зеленых" бизнес-практик и применить их. <a '
            'href="https://www.greenbiz.com/">Подробнее о зеленом бизнесе</a>',
            'Проведите аудит энергопотребления и идентифицируйте области, где можно сэкономить энергию, например, '
            'переход на энергоэффективные источники освещения или обновление систем отопления и кондиционирования. <a '
            'href="https://www.energy.gov/">Как сэкономить энергию в бизнесе</a>',
            'Проведите опрос сотрудников, чтобы понять их потребности и улучшить условия труда. Обратите внимание на '
            'эргономику рабочих мест и уровень удовлетворенности сотрудников. <a href="https://www.osha.gov/">Улучшение'
            'рабочих условий</a>',
            'Проведите безопасность на рабочем месте и разработайте программу обучения по предотвращению травм. '
            'Внедрите процедуры для быстрого реагирования на аварийные ситуации. <a '
            'href="https://www.osha.gov/">Охрана труда</a>',
            'Рассмотрите возможности сотрудничества с местными организациями и инициативами. Участвуйте в '
            'благотворительных'
            'мероприятиях и волонтёрстве. <a href="https://www.investopedia.com/">Поддержка местных сообществ</a>',
            'Разработайте стратегию корпоративной социальной ответственности (CSR) и участвуйте в проектах, '
            'направленных на решение социальных и экологических проблем. <a href="https://www.csrwire.com/">CSR в '
            'бизнесе</a>',
            'Ознакомьтесь с соответствующими отраслевыми стандартами и законодательством и убедитесь, что ваша '
            'компания их'
            'соблюдает. <a href="https://www.iso.org/">Соблюдение норм и стандартов</a>',
            'Разработайте бюджет и стратегию управления финансами. Исследуйте возможности сокращения издержек и '
            'оптимизации'
            'финансовых процессов. <a href="https://www.investopedia.com/">Управление финансами</a>',
            'Проведите исследование удовлетворенности клиентов и используйте их обратную связь для улучшения '
            'продуктов и'
            'услуг. <a href="https://www.qualitydigest.com/">Улучшение качества продукции и услуг</a>'
        ]
    },
    'b2c': {
        'return': 'С возвращением!',
        'menu_button1': "Мои баллы",
        'menu_button2': "Что изучить",
        'menu_button3': "Эко организации региона",
        'menu_button4': "У меня есть идея",
        'menu_button5': "Пройти опрос заново",
        'register_message': "Пожалуйста введи как к тебе обращаться:",
        'quiz_success': 'Поздравляем! Вы заботитесь об окружающей среде!',
        'quiz_start': 'Пройдите небольшой опрос, чтобы оценить ваши экологические привычки',
        'quiz_result': 'Процент вашей экологической грамотности {}%',
        'quiz_gift': 'Вы получили подарок! Нажмите ниже, чтобы посмотреть',
        'quiz_questions': [
            "Сортируете ли Вы мусор?",
            "Знаете ли Вы, что обозначают цвета контейнеров для мусора?",
            "Сдаете ли Вы батарейки на переработку?",
            "Участвуете ли вы в социальных или волонтерских мероприятиях?",
            "Считаете ли вы, что компания должна предоставлять своим работникам социальную поддержку?"
        ],
        'quiz_advices': [
            'Переходи по <a href="https://www.google.com/amp/s/medservise24.ru/blog/amp/zachem-sortirovat-musor'
            '/">ссылке</a> и'
            'узнавай больше о пользе от сортировки мусора',
            'Переходи по <a href="https://ashaindia.ru/sortirovka-musora/#:~:text=%D0%A1%D0%BE%D1%80%D1%82%D0%B8%D1'
            '%80%D0%BE%D0%B2%D0%BA%D1%83%20%D0%BC%D1%83%D1%81%D0%BE%D1%80%D0%B0%20%D0%BB%D1%83%D1%87%D1%88%D0%B5%20'
            '%D0%BD%D0%B0%D1%87%D0%B8%D0%BD%D0%B0%D1%82%D1%8C%20%D1%81%D1%80%D0%B0%D0%B7%D1%83,'
            '%D0%B2%20%D0%BD%D1%83%D0%B6%D0%BD%D1%8B%D0%B9%20%D0%BA%D0%BE%D0%BD%D1%82%D0%B5%D0%B9%D0%BD%D0%B5%D1%80'
            '%20%D0%B4%D0%BB%D1%8F%20%D0%B2%D1%82%D0%BE%D1%80%D1%81%D1%8B%D1%80%D1%8C%D1%8F">ссылке</a> и узнавай как '
            'правильно сортировать мусор',
            'Переходи по ссылке и узнавай больше о <a '
            'href="https://www.contr.ru/Neobhodimost_v_utilizatsii_ispolzovannyh_istochnikov_elektrichestva.htm'
            '">важности переработки батареек</a> и о <a '
            'href="https://2gis.ru/irkutsk/search/%D0%9F%D1%83%D0%BD%D0%BA%D1%82%D1%8B%20%D0%BF%D1%80%D0%B8%D0%B5%D0'
            '%BC%D0%B0%20%D0%B1%D0%B0%D1%82%D0%B0%D1%80%D0%B5%D0%B5%D0%BA">ближайших пунктах приема</a>',
            'Современные компании должны обеспечивать социальную поддержку работников и ответственно относиться к с '
            'своим клиентам, <a href="https://hh.ru/article/30695">подробнее об этом</a>',
            'Современные компании должны обеспечивать социальную поддержку работников и ответственно относиться к с '
            'своим клиентам, <a href="https://hh.ru/article/30695">подробнее об этом</a>'

        ]
    },
    'task': {
        'message': '{}',
        'button1': "Выполнить",
        'button2': "Добавить в избранное"
    },
    'admin': {
        'menu': {
            'button1': "Создать задание",
            "button2": "Получить задание"
        },
        'create_task': {
            'button1': "Создать тему"
        },
        'get_task': {}
    }
}

LEXICON_COMMANDS_RU: dict[str, str] = {

}
