LEXICON_RU = {
    'register': 'Привет, {}! Перед тобой бот <b>ЭКО МИР</b>, который может:\n— рассказать о '
                'проводимых экологических мероприятиях\n— дать информацию об организациях-партнерах\n— в игровой форме '
                'повысить твою экограмотность\n\nСейчас мы предлагаем тебе пройти тест из десяти вопросов и '
                'выполнить несколько заданий. Это займет не больше _ минут. За каждый правильный ответ и каждое верно '
                'выполненное задание ты получишь баллы, которые затем можно будет обменять на призы!\n\nНашли ошибку? '
                'Что-то не работает? По вопросам обращайся по ссылке: @KiRiLLBElNOS\n\nДавай начнем!',
    'start_b2b': 'Бизнес💼',
    'start_b2c': 'Человек🧤',
    'void_name': 'Вы не ввели название, пожалуйста введите еще раз',
    'registration_complete': 'Вы успешно зарегистрированы',
    'quiz_get_result': "Опрос завершен! Нажмите ниже, чтобы получить результаты)",
    'quiz_get_result_button': "Получить результат",
    'menu_message': 'Привет. Перед тобой бот <b>ЭКО МИР</b>, который может:\n— рассказать о '
                    'проводимых экологических мероприятиях\n— дать информацию об организациях-партнерах\n— в игровой форме '
                    'повысить твою экограмотность\n\nНашли ошибку? '
                    'Что-то не работает? По вопросам обращайся по ссылке: @KiRiLLBElNOS\n\nДавай начнем!',
    'back_button': "Назад",
    'my_score': {
        "message": "Здесь содержится информация о твоем счете, способах накопить больше баллов, а также то, где и на "
                   "что их можно потратить.\n\nКоличество баллов на счету: {}",
        "button1": "Заработать",
        "button2": "Потратить"
    },
    'what_study': {
        "message": "В этом разделе находятся различные полезные источники (видеоуроки, книги, статьи), через которые "
                   "ты можешь узнать больше об экологичном образе жизни и интересных новостях. Здесь также собраны "
                   "данные об экологических организациях твоего региона и работающих пунктах сбора вторсырья.",
        "button1": "Видеоуроки",
        "button2": "Книги и статьи",
        "button3": "Список ЭКО организаций региона",
        "button4": "Для меня",
        "button5": "Пункты сбора"
    },
    'eco_org': {
        "message": 'Здесь ты можешь узнать о экологических мероприятиях (форумы, экодворы и пр.) своего и других '
                   'регионов. Через бот можно оставить заявку на участие или записаться в качестве волонтера.\n\nЖми '
                   'на кнопку "Предложить мероприятие", если не нашел его в списке!',
        "button1": "Афиша мероприятий",
        "button2": "Предложить мероприятия админу",
        "button3": "Избранные мероприятия"
    },
    'have_idea': {
        "message": "Если у тебя есть предложения по благоустройству своего города или ты уже начал обдумывать свой "
                   "бизнес-план, то ты можешь прислать сюда свои идеи и оставить контакты. В разделе также находятся "
                   "полезные видеоуроки.",
        "button1": "Шаблонный план ESG",
        "button2": "Детальный план"
    },
    'earn_score': {
        "message": "Здесь содержится информация о твоем счете, способах накопить больше баллов, а также то, где и на "
                   "что их можно потратить.\n\nКоличество баллов на счету: {}",
        "button1": "Пригласить друга",
        "button2": "Задания"
    },
    'buy_score': {
        "message": "Здесь содержится информация о твоем счете, способах накопить больше баллов, а также то, где и на "
                   "что их можно потратить.\n\nКоличество баллов на счету: {}",
        "button1": "Мини подарки",
        "button2": "Экскурсии",
        "button3": "Встречи с экспертами",
        "button4": "Путешествие",
        "button5": "Партнеры",
    },
    'template_idea': {
        "message": "Если у тебя есть предложения по благоустройству своего города или ты уже начал обдумывать свой "
                   "бизнес-план, то ты можешь прислать сюда свои идеи и оставить контакты. В разделе также находятся "
                   "полезные видеоуроки.",
        "button1": "Видеоуроки",
        "button2": "План"
    },
    "video_course": {
        "message": "В этом разделе находятся различные полезные источники (видеоуроки, книги, статьи), через которые "
                   "ты можешь узнать больше об экологичном образе жизни и интересных новостях. Здесь также собраны "
                   "данные об экологических организациях твоего региона и работающих пунктах сбора вторсырья.",
    },
    "books": {
        "message": "В этом разделе находятся различные полезные источники (видеоуроки, книги, статьи), через которые "
                   "ты можешь узнать больше об экологичном образе жизни и интересных новостях. Здесь также собраны "
                   "данные об экологических организациях твоего региона и работающих пунктах сбора вторсырья.",
    },
    "eco_states": {
        "message": "В этом разделе находятся различные полезные источники (видеоуроки, книги, статьи), через которые "
                   "ты можешь узнать больше об экологичном образе жизни и интересных новостях. Здесь также собраны "
                   "данные об экологических организациях твоего региона и работающих пунктах сбора вторсырья.",
    },
    "for_me": {
        "message": "В этом разделе находятся различные полезные источники (видеоуроки, книги, статьи), через которые "
                   "ты можешь узнать больше об экологичном образе жизни и интересных новостях. Здесь также собраны "
                   "данные об экологических организациях твоего региона и работающих пунктах сбора вторсырья.",
    },
    "appointment": {
        "message": "В этом разделе находятся различные полезные источники (видеоуроки, книги, статьи), через которые "
                   "ты можешь узнать больше об экологичном образе жизни и интересных новостях. Здесь также собраны "
                   "данные об экологических организациях твоего региона и работающих пунктах сбора вторсырья.",
    },
    "poster": {
        "message": 'Здесь ты можешь узнать о экологических мероприятиях (форумы, экодворы и пр.) своего и других '
                   'регионов. Через бот можно оставить заявку на участие или записаться в качестве волонтера.\n\nЖми '
                   'на кнопку "Предложить мероприятие", если не нашел его в списке!',
    },
    "produce_meet": {
        "message": 'Здесь ты можешь узнать о экологических мероприятиях (форумы, экодворы и пр.) своего и других '
                   'регионов. Через бот можно оставить заявку на участие или записаться в качестве волонтера.\n\nЖми '
                   'на кнопку "Предложить мероприятие", если не нашел его в списке!',
    },
    'plan_idea': {
        "message": "Если у тебя есть предложения по благоустройству своего города или ты уже начал обдумывать свой "
                   "бизнес-план, то ты можешь прислать сюда свои идеи и оставить контакты. В разделе также находятся "
                   "полезные видеоуроки.",
        "button1": "Конкретный план для начинающих",
        "button2": "Встречи с экспертом",
        "button3": "Материалы для меня"
    },
    'pick_tasks': {
        "message": "Здесь содержится информация о твоем счете, способах накопить больше баллов, а также то, где и на "
                   "что их можно потратить.\n\nКоличество баллов на счету: {}",
        'button1': 'Избранные',
        'button2': 'Выполненные',
        'button3': 'Новые задания',
    },
    'themes_earn': {
        "message": "Список доступных тем"
    },
    'menu_b2c': {
        "message": "Выберите, что хотите сделать"
    },
    'business': {
        'return': 'С возвращением! {}',
        'menu_button1': "Насколько мой бизнес ESG",
        'menu_button2': "ЭКО организации региона",
        'menu_button3': "Топ список компаний ESG",
        'menu_button4': "Пройти опрос заново",
        'register_message': "Отлично, значит вы организация! Пожалуйста введите свое название:",
        'quiz_success': 'Поздравляем! Вы построили экологичный бизнес',
        'quiz_start': 'Пройдите небольшой опрос, чтобы узнать уровень экологичности вашей компании',
        'quiz_result': "Процент экологичности вашего бизнеса {}%",
        'quiz_questions': [
            "Делает ли ваш бизнес что-то, чтобы беречь нашу планету и окружающую среду?",
            "Старается ли ваша компания экономить электроэнергию и не тратить ее много?",
            "Уделяет ли ваша компания внимание условиям работы сотрудников и их комфорту?",
            "Обеспечиваете ли вы безопасные условия труда, чтобы избежать травм сотрудников?",
            "Помогает ли ваш бизнес местным сообществам и поддерживает их?",
            "Стремится ли ваша компания сделать мир лучше через свои действия?",
            "Стремится ли ваш бизнес соблюдать нормы и стандарты в своей деятельности?",
            "Управляет ли ваша компания финансами ответственно и эффективно?",
            "Гарантирует ли ваш бизнес, что его продукты и услуги всегда будут качественными и полезными?",
        ],
        'quiz_advices': [
            'Рассмотрите возможности сокращения использования одноразовой упаковки, пересмотрите свои '
            'производственные процессы с'
            'целью уменьшения отходов и выбросов. Можете изучить концепцию "зеленых" бизнес-практик и применить их. <a '
            'href="https://www.greenbiz.com/">Подробнее о зеленом бизнесе</a>',
            'Проведите аудит энергопотребления и идентифицируйте области, где можно сэкономить энергию, например, '
            'переход на энергоэффективные источники освещения или обновление систем отопления и кондиционирования. <a '
            'href="https://www.energy.gov/">Как сэкономить энергию в бизнесе</a>',
            'Проведите опрос сотрудников, чтобы понять их потребности и улучшить условия труда. Обратите внимание на '
            'эргономику рабочих мест и уровень удовлетворенности сотрудников. <a href="https://www.osha.gov/">Улучшение'
            'рабочих условий</a>',
            'Проведите безопасность на рабочем месте и разработайте программу обучения по предотвращению травм. '
            'Внедрите процедуры для быстрого реагирования на аварийные ситуации. <a '
            'href="https://www.osha.gov/">Охрана труда</a>',
            'Рассмотрите возможности сотрудничества с местными организациями и инициативами. Участвуйте в '
            'благотворительных'
            'мероприятиях и волонтёрстве. <a href="https://www.investopedia.com/">Поддержка местных сообществ</a>',
            'Разработайте стратегию корпоративной социальной ответственности (CSR) и участвуйте в проектах, '
            'направленных на решение социальных и экологических проблем. <a href="https://www.csrwire.com/">CSR в '
            'бизнесе</a>',
            'Ознакомьтесь с соответствующими отраслевыми стандартами и законодательством и убедитесь, что ваша '
            'компания их'
            'соблюдает. <a href="https://www.iso.org/">Соблюдение норм и стандартов</a>',
            'Разработайте бюджет и стратегию управления финансами. Исследуйте возможности сокращения издержек и '
            'оптимизации'
            'финансовых процессов. <a href="https://www.investopedia.com/">Управление финансами</a>',
            'Проведите исследование удовлетворенности клиентов и используйте их обратную связь для улучшения '
            'продуктов и'
            'услуг. <a href="https://www.qualitydigest.com/">Улучшение качества продукции и услуг</a>'
        ]
    },
    'person': {
        'return': 'Привет, с возвращением {}! Перед тобой бот <b>ЭКО МИР</b>, который может:\n— рассказать о '
                  'проводимых экологических мероприятиях\n— дать информацию об организациях-партнерах\n— в игровой форме '
                  'повысить твою экограмотность\n\nНашли ошибку? '
                  'Что-то не работает? По вопросам обращайся по ссылке: @KiRiLLBElNOS\n\nДавай начнем!',
        'menu_button1': "Действия с баллами",
        'menu_button2': "Что нужно знать",
        'menu_button3': "Мероприятия",
        'menu_button4': "У меня есть идея",
        'menu_button5': "Пройти опрос заново",
        'register_message': "Пожалуйста введи как к тебе обращаться:",
        'quiz_success': 'Поздравляем! Вы заботитесь об окружающей среде!',
        'quiz_start': 'Пройдите небольшой опрос, чтобы оценить ваши экологические привычки',
        'quiz_result': 'Процент вашей экологической грамотности {}%',
        'quiz_gift': 'Вы получили подарок! Нажмите ниже, чтобы посмотреть',
        'quiz_questions': [
            "Сортируете ли Вы мусор?",
            "Знаете ли Вы, что обозначают цвета контейнеров для мусора?",
            "Сдаете ли Вы батарейки на переработку?",
            "Участвуете ли вы в социальных или волонтерских мероприятиях?",
            "Считаете ли вы, что компания должна предоставлять своим работникам социальную поддержку?"
        ],
        'quiz_advices': [
            'Переходи по <a href="https://www.google.com/amp/s/medservise24.ru/blog/amp/zachem-sortirovat-musor'
            '/">ссылке</a> и'
            'узнавай больше о пользе от сортировки мусора',
            'Переходи по <a href="https://ashaindia.ru/sortirovka-musora/#:~:text=%D0%A1%D0%BE%D1%80%D1%82%D0%B8%D1'
            '%80%D0%BE%D0%B2%D0%BA%D1%83%20%D0%BC%D1%83%D1%81%D0%BE%D1%80%D0%B0%20%D0%BB%D1%83%D1%87%D1%88%D0%B5%20'
            '%D0%BD%D0%B0%D1%87%D0%B8%D0%BD%D0%B0%D1%82%D1%8C%20%D1%81%D1%80%D0%B0%D0%B7%D1%83,'
            '%D0%B2%20%D0%BD%D1%83%D0%B6%D0%BD%D1%8B%D0%B9%20%D0%BA%D0%BE%D0%BD%D1%82%D0%B5%D0%B9%D0%BD%D0%B5%D1%80'
            '%20%D0%B4%D0%BB%D1%8F%20%D0%B2%D1%82%D0%BE%D1%80%D1%81%D1%8B%D1%80%D1%8C%D1%8F">ссылке</a> и узнавай как '
            'правильно сортировать мусор',
            'Переходи по ссылке и узнавай больше о <a '
            'href="https://www.contr.ru/Neobhodimost_v_utilizatsii_ispolzovannyh_istochnikov_elektrichestva.htm'
            '">важности переработки батареек</a> и о <a '
            'href="https://2gis.ru/irkutsk/search/%D0%9F%D1%83%D0%BD%D0%BA%D1%82%D1%8B%20%D0%BF%D1%80%D0%B8%D0%B5%D0'
            '%BC%D0%B0%20%D0%B1%D0%B0%D1%82%D0%B0%D1%80%D0%B5%D0%B5%D0%BA">ближайших пунктах приема</a>',
            'Современные компании должны обеспечивать социальную поддержку работников и ответственно относиться к с '
            'своим клиентам, <a href="https://hh.ru/article/30695">подробнее об этом</a>',
            'Современные компании должны обеспечивать социальную поддержку работников и ответственно относиться к с '
            'своим клиентам, <a href="https://hh.ru/article/30695">подробнее об этом</a>'

        ]
    },
    'task': {
        'message': '{}',
        'button1': "Выполнить",
        'button2': "Добавить в избранное"
    },
    'admin': {
        'menu': {
            'message': 'Выберите, что хотите сделать',
            'button1': "Редактировать задания",
            "button2": "Редактировать опросы",
            "button3": "Редактировать товары",
            "button4": "Редактировать мероприятия",
            "button5": "Редактировать список организаций",
            "button6": "Редактировать планы",
        },
        'change_task': {
            'message': 'Как вы хотите изменить задания',
            'button1': 'Создать задание',
            'button2': 'Посмотреть задание',
            'button3': 'Удалить задание',
        },
        'change_survey': {
            'message': 'Как вы хотите изменить опросы',
            'button1': 'Создать опрос',
            'button2': 'Посмотреть опрос',
            'button3': 'Изменить вступительный опрос'
        },
        'change_product': {
            'message': 'Как вы хотите изменить товары',
            'button1': 'Добавить товар',
            'button2': 'Посмотреть товар',
            'button3': 'Изменить стоимость товара',
            'button4': 'Удалить товар'
        },
        'change_event': {
            'message': 'Как вы хотите изменить мероприятия',
            'button1': 'Добавить мероприятия',
            'button2': 'редактировать мероприятия'
        },
        'change_main_survey': {
            'message': 'Выберите для какого нpаправления вы хотите изменить опрос',
            'button1': 'B2C',
            'button2': 'B2B'
        },
        'pick': {
            "button1": "Как пользователь",
            "button2": "Как админ"
        },
        'create_task': {
            'message': "Создать новую тему или выбрать старую",
            'button1': "Создать тему"
        },
        'create_survey': {
            'message': "Создать новую тему или выбрать старую",
            'button1': "Создать тему"
        },
        'create_event': {
            'message': "Создать новую тему или выбрать старую",
            'button1': "Создать тему"
        },
        'edit_task': {
            'message': "Посмотреть информацию о задании и изменить его",
        },
        'task_choose_edit': {
            'message': "Вы хотите изменить задание или удалить"
        },
        'task_editor': {
            'message': "Как вы хотите изменить задание"
        },
        'delete_task': {
            'message': "Удалить задание",
        },
        'Admin:task_theme': {
            'message': 'Введите тему'
        },
        'Admin:task_name': {
            'message': 'Введите название задачи (не длиннее 64 символов)'
        },
        'Admin:task_description': {
            'message': 'Введите описание задачи'
        },
        'Admin:task_score': {
            'message': 'Введите число'
        },
        'Admin:survey_theme': {
            'message': 'Введите тему'
        },
        'Admin:survey_name': {
            'message': 'Введите название опроса (не длиннее 64 символов)'
        },
        'Admin:survey_score': {
            'message': 'Введите число'
        },
        'Admin:survey_questions': {
            'message': 'Введите вопрос'
        },
        'Admin:survey_options': {
            'message': 'Введите текст варианта ответа или нажмите кнопку '
                       'завершить, чтобы закончить вопрос'
        },
        'Admin:product_score': {
            'message': 'Введите число'
        },
        'Admin:product_name': {
            'message': 'Введите название товара (не длиннее 64 символов)'
        },
        'Admin:product_image': {
            'message': 'Вы должны ввести ссылку'
        },
        'Admin:task_edit_title': {
            'message': "Введите название задачи (не длиннее 64 символов)"
        },
        'Admin:task_edit_description': {
            'message': "Введите описание задачи"
        },
        'Admin:task_edit_value': {
            'message': "Введите число"
        },
        'Admin:survey_edit_option': {
            'message': "Введите новый текст ответа"
        },
        'Admin:survey_edit_question': {
            'message': "Введите новый текст вопроса"
        },
        'Admin:event_theme': {
            'message': 'Введите название темы'
        },
        'Admin:event_title': {
            'message': 'Введите название мероприятия'
        },
        'Admin:event_description': {
            'message': 'Введите описание мероприятия'
        },
        'Admin:event_place': {
            'message': 'Введите место проведения мероприятия'
        },
        'Admin:event_organizer': {
            'message': 'Введите организатора мероприятия'
        },
        'Admin:event_image_url': {
            'message': 'Введите ссылку на изображение'
        },
        'Admin:event_capacity': {
            'message': 'Введите вместимость мероприятия'
        },
        'Admin:event_value': {
            'message': 'Введите баллы за мероприятие'
        },
        'Admin:event_date': {
            'message': 'Введите дату проведения мероприятия'
        },
    }
}

LEXICON_COMMANDS_RU: dict[str, str] = {

}
